
public class Dz10klas29str_Prodov {

	public static void main(String[] args) {
		int a = 10;
		if( a % 2 == 0){ 
			System.out.println("Залишок дорівнює нулю - означає число "+a+" парне");}
		if( a % 2 != 0){
			System.out.println("Залишок недорівнює нулю - число "+a+" непарне");}
	//За введеним числом а визначити чи дане число додатне чи від'ємно чи равно 0
		if(a>0)
			System.out.println("Число "+a+" позитивне");
		if(a<0)
			System.out.println("Число "+a+" негативне");
		if(a==0)
			System.out.println("Число "+a+" число дорівнює нулю");
	//Дано трицифрове число. Замінити его на сумму його цифр, якщо воно кратне 9 
	}

}
