
/**
 * Задача: вывести непарные числа с 5 до 25 используя метод for
 * @author USER
 *
 */
public class DomashneeZadanie4 {

	public static void main(String[] args) {
		for (int chislo = 5; chislo <=25; chislo = chislo + 2)
		{
			System.out.println(chislo);
		}

	}

}
